EA/src/Catalogs/Логи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Логи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БазаДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдресХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЛога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЛогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидРезультатаВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящиеДанные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВыполненияПодробно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

EA/src/Enums/ВидРезультатаВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВидРезультатаВыполнения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗавершеноСОшибками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УспешноЗавершено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗавершено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

EA/src/Catalogs/Логи/ManagerModule.bsl
Функция СоздатьЛог(ВидЛог,ДатаНачала,Наименование,ВходящиеДанные = "") Экспорт
	
	Лог = Справочники.Логи.СоздатьЭлемент();
	Лог.БазаДанных = ПараметрыСеанса.ТекущийАдресХранения;
	Лог.ВидЛога = ВидЛог;
	Лог.ДатаНачала = ДатаНачала;
	Лог.Наименование = Наименование;
	Лог.ВходящиеДанные = ВходящиеДанные;
	Лог.РезультатВыполнения = Перечисления.ВидРезультатаВыполнения.НеЗавершено;
	Лог.Записать();
	
	Возврат Лог.Ссылка
	
КонецФункции

Процедура ЗаписатьИзмененияВЛог(ЛогСсылка,Сообщение,Завершение = неопределено) Экспорт
	Лог = ЛогСсылка.ПолучитьОбъект();
	Лог.РезультатВыполненияПодробно = Лог.РезультатВыполненияПодробно + Символы.ПС;
	Лог.РезультатВыполненияПодробно = Лог.РезультатВыполненияПодробно + Формат(ТекущаяДата(),"") + Символы.ПС;
	Лог.РезультатВыполненияПодробно = Лог.РезультатВыполненияПодробно + Сообщение;
	
	МассивСообщений = ПолучитьСообщенияПользователю(Истина);
	
	Если МассивСообщений.Количество() > 0 тогда
		Лог.РезультатВыполненияПодробно = Лог.РезультатВыполненияПодробно + Символы.ПС+"Накопленные сообщения:";		
	КонецЕсли;
	
	Для каждого Сообщение из МассивСообщений цикл
		Лог.РезультатВыполненияПодробно = Лог.РезультатВыполненияПодробно + Символы.ПС + Сообщение.текст;
	КонецЦикла;
	
	Лог.РезультатВыполнения = Перечисления.ВидРезультатаВыполнения.НеЗавершено;
	
	Если Завершение = Истина тогда
		Лог.РезультатВыполнения = Перечисления.ВидРезультатаВыполнения.УспешноЗавершено;
	ИначеЕсли Завершение = Ложь тогда
		Лог.РезультатВыполнения = Перечисления.ВидРезультатаВыполнения.ЗавершеноСОшибками;
	КонецЕсли;
	
	Если Завершение <> неопределено тогда
		Лог.ДатаЗавершения = ТекущаяДата();
	КонецЕсли;
	
	Лог.Записать();
	
КонецПроцедуры
